[
    "Is your father a baker? Because you've got great buns.",
    "If I could rearrange the alphabet, I'd put 'u' and 'I' together.",
    "Are you a parking ticket? Because you've got fine written all over you.",
    "I’m learning about important dates in history. Wanna be one of them?",
    "Are you a bank loan? Because you got my interest.",
    "It's a good thing I have my library card, because I am totally checking you out.",
    "Can I follow you where you’re going right now? Because my parents always told me to follow my dreams.",
    "My love for you is like diarrhea, I just can't hold it in.",
    "Do you like Star Wars? Because Yoda only one for me!",
    "Roses are red, my face is too, that only happens when I’m around you.",
    "Do you have a name or can I call you mine?",
    "You look so familiar... didn’t we take a class together? I swear we had chemistry.",
    "Did it hurt? When you fell out of heaven?",
    "Do you have a map? Because I just keep on getting lost in your eyes.",
    "Does your dad own a dairy company, 'cause you've got a nice set of jugs.",
    "I have only three months to live.",
    "The developers of this website have trapped me and are forcing me to deliver pickup lines. Help!",
    "Did you just come out of the oven, cuz you're hot!",
    "You're so beautiful that you made me forget my pickup line.",
    "You must be the square root of two. Cause I feel irrational around you.",
    "Do you like bad grades? Because I can give you the D.",
    "Are you a magician? Because whenever I look at you, everyone else disappears!",
    "I’m not a photographer, but I can picture me and you together.",
    "Do I know you? ‘Cause you look a lot like my next girlfriend/boyfriend.",
    "Do you know what my shirt is made of? Boyfriend/girlfriend material?",
    "They say Disneyland is the happiest place on earth. Well apparently, no one has ever been standing next to you.",
    "For some reason, I was feeling a little off today. But when you came along, you definitely turned me on.",
    "Are you religious? Because you’re the answer to all my prayers.",
    "I seem to have lost my phone number. Can I have yours?",
    "I’m lost. Can you give me directions to your heart?",
    "Are you sure you’re not tired? You’ve been running through my mind all day.",
    "Is there an airport nearby or is it my heart taking off?",
    "Was your dad a boxer? Because damn, you’re a knockout!",
    "I was wondering if you had an extra heart. Mine was just stolen.",
    "Would you grab my arm, so I can tell my friends I’ve been touched by an angel?",
    "There’s only one thing I want to change about you, and that’s your last name.",
    "Aside from being sexy, what do you do for a living?",
    "Hi, how was heaven when you left it?",
    "Do you believe in love at first sight or should I pass by again?",
    "Is your dad a terrorist? Cause you’re the bomb.",
    "Did the sun come out or did you just smile at me?",
    "Kiss me if I’m wrong, but dinosaurs still exist, right?",
    "Hey, you’re pretty and I’m cute. Together we’d be Pretty Cute.",
    "Did it hurt? When you fell from heaven?",
    "Can I follow you home? Cause my parents always told me to follow my dreams.",
    "Is your name Google? Because you have everything I’ve been searching for.",
    "Are you from Tennessee? Because you’re the only ten I see!",
    "Hello, I’m a thief, and I’m here to steal your heart.",
    "I may not be a genie, but I can make your dreams come true.",
    "If nothing lasts forever, will you be my nothing?",
    "There must be something wrong with my eyes, I can’t take them off you.",
    "I’m sorry, were you talking to me? No? Well then, please start.",
    "Was you father an alien? Because there’s nothing else like you on Earth!",
    "Was your father a thief? ‘Cause someone stole the stars from the sky and put them in your eyes.",
    "Do you have a pencil? Cause I want to erase your past and write our future.",
    "I’d say God Bless you, but it looks like he already did.",
    "I must be in a museum, because you truly are a work of art.",
    "Are you my phone charger? Because without you, I’d die.",
    "Can you take me to the doctor? Because I just broke my leg falling for you.",
    "You don’t need keys to drive me crazy.",
    "Are you a dictionary? Cause you’re adding meaning to my life.",
    "You remind me of a magnet, because you sure are attracting me over here!",
    "I’m no mathematician, but I’m pretty good with numbers. Tell you what, give me yours and watch what I can do with it.",
    "Didn’t I see you on the cover of Vogue?",
    "Somebody call the cops, because it’s got to be illegal to look that good!",
    "You must be a broom, ‘cause you just swept me off my feet."
]
